Tekla Open API Reference for Tekla Structures 2025
UserDefinedElement Class
 The UserDefinedElement class represents a user-defined attribute specified by its name. A user-defined element is converted into a textual value before it is drawn.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.UserDefinedElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class UserDefinedElement : ElementBase
<SerializableAttribute>
Public NotInheritable Class UserDefinedElement
	Inherits ElementBase
The UserDefinedElement type exposes the following members.
Constructors
Name | Description
UserDefinedElement(String)
 Creates a new user-defined element instance with the given name.
UserDefinedElement(String, FontAttributes)
 Creates a new user-defined element instance with the given name and font.
Top
Properties
Name | Description
Font
 The font of the user-defined attribute.
Name
 The name of the user-defined attribute.
Unit
 Gets or sets the unit attributes.
Value
 The value of the user-defined attribute.
Top
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace